/*
	路由配置
 */
const TYPEID = {
    '0': 'about.go',
    '1': '系统管理',
    '2': 'sys_logList.go',
    '3': 'sys_menuManager.go',
    '4': '系统设置',
    '5': '黑名单',
    '6': '账户信息',
    '7': 'sys_userManager.go',
    '8': '显示设置',
    '9': '点餐管理',
    '10': '类目设置',
    '11': '菜谱管理',
    '12': '口味设置',
    '13': '份量设置',
    '14': '游戏管理',
    '15': '彩票类游戏',
    '16': '街机类游戏',
    '17': '支付管理',
    '18': '订单管理',
    '19': '订单交易查询',
    '20': '订单交易流水'
}

const TYPENAME = {
    '1': '系统管理',
    '2': '日志信息',
    '3': '菜单管理',
    '4': '系统设置',
    '5': '黑名单',
    '6': '账户信息',
    '7': '用户管理',
    '8': '显示设置',
    '9': '点餐管理',
    '10': '类目设置',
    '11': '菜谱管理',
    '12': '口味设置',
    '13': '份量设置',
    '14': '游戏管理',
    '15': '彩票类游戏',
    '16': '街机类游戏',
    '17': '支付管理',
    '18': '订单管理',
    '19': '订单交易查询',
    '20': '订单交易流水'
}

const TYPEPID = {
    '1': '0',
    '2': '1',
    '8': '4'
}

export {
    TYPEID,
    TYPEPID,
    TYPENAME
}